In [5]:
from dataframe import *

Tabela Students:

   student_id student_name student_education
0           1       Carlos        Engenharia
1           2      Mariana          Medicina

Tabela Tutors:

   tutor_id tutor_name tutor_expertise
0         1       João      Matemática
1         2        Ana        História

INNER JOIN - Students e Memberships:

  student_name membership_type
0       Carlos            Gold
1      Mariana          Silver

INNER JOIN - Tutors e Contracts:

  tutor_name  base_salary  bonus
0       João         3000    500
1        Ana         2500    400

SELECT - Alunos de Engenharia:

  student_name
0       Carlos

SELECT - Tutors de História:

  tutor_name
0        Ana

Consultas finalizadas! ✅